# Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

num = int(input('Введите трехзначное число: '))
text = f'{num} -> '
i = 0
sum = 0
while i < 3:
    sum = sum + (num % 10)
    num //= 10
    i += 1
print(text, sum)